{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 95, "batch_input_shape": [null, 40], "W_regularizer": null, "dropout": 0.0, "output_dim": 24, "input_length": 40}}, {"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 512, "unroll": false, "consume_less": "gpu", "init": "glorot_uniform", "dropout_U": 0.2, "input_dtype": "float32", "batch_input_shape": [null, null, 24], "input_length": null, "dropout_W": 0.2, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_1", "go_backwards": false, "input_dim": 24, "return_sequences": true, "W_regularizer": null, "forget_bias_init": "one"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.2, "dropout_W": 0.2, "input_dim": 512, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512, "forget_bias_init": "one", "input_length": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 95}}, "trainable": true, "name": "timedistributed_1"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}